# St7CleanMesh

Performs a mesh cleaning operation on the Strand7 model using the current settings.

long St7CleanMesh(long uID)
Input Parameters
uID
Strand7 model file ID.
Dependencies
Clean Mesh Options
Assigned using St7SetCleanMeshOptions.